/* Errors returned by the device in the form of xml */
"Success" = "Åtgärden lyckades";
"TestInProgress" = "Test pågår... Var god vänta.";
"ErrorDeviceBusy" = "Enheten är upptagen. Gör ett nytt försök senare.";
"ErrorDuplicateDisplayName" = "Dubblerat skärm- eller platsnamn. Ange ett annat namn och försök igen.";
"ErrorEmptyEntry" = "En av posterna i de inställningar som skickats till enheten är tom. Kontrollera att alla poster är giltiga och försök igen.";
"ErrorListFull" = "Det finns inte plats att lägga till den här posten. Radera en post från enheten och försök igen.";
"ErrorSettingNotTested" = "Denna inställning har inte testats.";
"ErrorSystemFailure" = "Ett kritiskt fel har uppstått. Försök igen senare.";
"ErrorNoMoreSpace" = "Maxstorleken för e-postbilagor är för stor för den valda servern. Ange ett lägre värde och försök igen.";
"ErrorNoWritePermission" = "Du har inte skrivbehörighet för den markerade mappen. Ställ in lämplig behörighet till mappen och försök igen.";
"ErrorConnectionFailed" = "Det går inte att ansluta enheten till den angivna fjärrservern. Verifiera serverinställningarna.";
"ErrorConnectionRefused" = "Anslutningen avböjdes av servern. Kontrollera att servern är påslagen och fungerar.";
"ErrorServerNotFound" = "Enheten kan inte identifiera serverns värdnamn. Verifiera serverinställningarna.";
"ErrorWrongCredentials" = "Servern godkände inte den användaridentitet som användes för autentisering. Ange rätt identitet och försök igen.";
"ErrorConnectionProblem" = "Det var problem vid anslutning till fjärrservern. Kontrollera att servern är ansluten till nätverket och fungerar.";
"ErrorProtocolNotSupported" = "Fjärrservern använder ett protokoll som inte stöds.";
"ErrorInvalidFileOrDirectory" = "Den angivna sökvägen är inte giltig. Ange en giltig sökväg och försök igen.";
"ErrorInvalidFolderPath" = "Den angivna sökvägen är inte giltig. Ange en giltig sökväg och försök igen.";
"ErrorInvalidShare" = "Den delade mappen är inte giltig. Ange en annan delad mapp och försök igen.";
"ErrorAuthenticationNeeded" = "Den angivna servern kräver autentisering. Ange den användaridentitet som krävs för att få behörighet till servern och försök igen.";
"ErrorSecureConnectionNotSupported" = "Servern stöder inte säker anslutning. Avmarkera rutan Använd SSL och försök igen.";
"ErrorSenderInvalid" = "Avsändarens e-postadress är inte giltig. Ange en giltig avsändaradress och försök igen.";
"ErrorRecipientInvalid" = "Mottagarens e-postadress är inte giltig. Ange en giltig mottagaradress och försök igen.";
"ErrorServerError" = "Servern returnerade ett fel. Den begärda operationen kan inte slutföras. Kontrollera om de serveruppgifter som du matat in är korrekta.";
"ErrorInvalidServerName" = "Den angivna servern är inte giltig. Ange en giltig SMTP-server och försök igen.";

"404 Not Found" = "Hittar inte enheten. Kontrollera att enheten är ansluten till nätverket och påslagen.";
"400 Bad Request" = "Begäran kan inte bearbetas på grund av att den innehåller ett fel. Försök igen senare.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "Enheten returnerade inte någon giltig URL. Vänta några minuter och försök igen.";

/* XML Data validation errors */
"Setting Error" = "Fel - data saknas eller är ogiltiga";
"MISSING_FOLDER_SETTING" = "Vissa uppgifter om destinationsmappen saknas. Välj en mapp, ange användarnamn och lösenord och gör sedan ett nytt försök.";
"MISSING_EMAIL_SETTING" = "Vissa uppgifter om e-postdestinationen saknas. Ange hela e-postinställningen och försök igen.";
"MISSING_SERVER_CREDENTIALS" = "Uppgifter för serveridentifikation saknas. Ange användarnamn och lösenord och försök igen.";
"MISSING_DISPLAY_NAME" = "Avsändarnamn saknas. Ange ett avsändarnamn och försök igen.";
"MISSING_EMAIL_ADDRESS" = "E-postadressen saknas. Ange en giltig e-postadress och försök igen.";
"MISSING_SERVER" = "Servern saknas. Ange en server och försök igen.";

"INVALID_PIN" = "Den angivna PIN-koden är ogiltig. Den måste innehålla exakt 4 siffror. Ange en giltig PIN-kod och försök igen.";
"INVALID_SERVER_PORT" = "Det angivna serverportnumret är inte giltigt. Det måste vara ett nummer mellan 1 och 65535.";
"INVALID_ATTMT_SIZE" = "Den angivna maxstorleken för bilagor är ogiltig. Det måste vara ett nummer mellan 1 och 9999. Ange -1 för automatisk inställning av bilagestorlek.";
"INVALID_DFADESTINATION" = "Den valda destinationen för digital fax är inte giltig. Välj en korrekt destination.";
"INVALID_POLLING_TIME" = "Det valda avsökningsintervallet är inte giltigt. Intervallet kan vara 5, 10, 15, 20, 30, 45 eller 60. Välj ett giltigt värde och försök igen.";
"INVALID_DISPLAY_NAME" = "Det angivna avsändarnamnet är ogiltigt. Ange ett avsändarnamn som innehåller färre än 25 tecken.";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Fel";
"GENERIC_DEVICE_ERROR_TITLE" = "Enhetsfel";
"GENERIC_DEVICE_ERROR_DESC" = "Ett okänt fel uppstod under kommunikation med enheten. Gör ett nytt försök senare.";
"XML_PARSING_ERROR" = "Enheten returnerade ogiltiga data. Vänta några minuter och försök igen.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "Ett fel uppstod vid kommunikation med enheten. Kontrollera att enheten och din maskin är anslutna till nätverket och försök igen.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Avbryt";
"Hide" = "Dölj";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Hittar inte enheten";
"DEVICE_NOT_FOUND_DESC" = "Det var problem med att kommunicera med enheten. Kontrollera att enheten är påslagen och korrekt ansluten och gör ett nytt försök.";

"PML_ERROR_TITLE" = "Enhetsfel";
"PML_ERROR_DESC1" = "Det var problem med att ställa in information för enheten. Kontrollera att de inmatade värdena är giltiga.";

"SETTING_REJECTED_TITLE" = "Inställningar ej godkända";

"SETTING_REJECTED_DESCRIPTION" = "Konfigurering kunde ej utföras på grund av att enheten skyddas av ett administratörslösenord. Använd Embedded Web Server för att ta bort administratörslösenordet. Se dokumentationen till enheten för ytterligare information";
"GENERAL_DATA_MISSING_DESCRIPTION" = "Minst ett fält är tomt. Fyll i alla fält eller klicka på Avbryt.";

//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Dörr/lucka öppen";
"DOOR_OPEN_DESC" = "Skrivaren kan inte skriva ut eftersom en lucka är öppen. Stäng alla luckor på skrivaren.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "Felstatus på skrivaren";
"INCORRECT_STATE_DESC" = "Åtgärda felet på enheten och försök igen.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "Skrivaren är upptagen";
"DEVICE_BUSY_DESC" = "Vänta tills skrivaren är klar med det pågående jobbet.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "Samtals-ID stöds inte";
"CALLER_ID_NOT_SUPPORTED_DESC" = "Den nuvarande inställningen av land/region på enheten stöder inte samtals-ID. Använd enhetens frontpanel för att välja ett land/en region som stöder samtals-ID och gör ett nytt försök.";


//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Kunde ej verkställa inställningarna.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Kontrollera att enheten är online och inte håller på att bearbeta ett faxjobb.";

